public class mili {

        public static void main(String[] args) {


            int cena = 10;
            int x = 20;
            int mili = cena / x;
            if (cena > x) {
                System.out.print("Начислено ");
                System.out.print(mili);
                System.out.println(" миль(и)");
            } else System.out.println("Мили не начислены");

            // Объявляете переменные для входных данных и
            // параметров программы: одну для хранения
            // стоимости билета, другую для хранения количества
            // рублей для одной бонусной милли

            // Рассчитываете количество бонусных милль, используя
            // значения заведённых переменных. Ответ сохраняете в
            // новую переменную и выводите на экран
        }

}
