public class Mili {

        public static void main(String[] args) {


            int price = 10;
            int x = 20;
            int miles = price / x;
            if (price > x) {
                System.out.print("Начислено ");
                System.out.print(miles);
                System.out.println(" миль(и)");
            } else System.out.println("Мили не начислены");

            // Объявляете переменные для входных данных и
            // параметров программы: одну для хранения
            // стоимости билета, другую для хранения количества
            // рублей для одной бонусной милли

            // Рассчитываете количество бонусных милль, используя
            // значения заведённых переменных. Ответ сохраняете в
            // новую переменную и выводите на экран
        }

}
